<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads latest Skype disk image and builds a package.</string>
        <key>Identifier</key>
        <string>com.github.autopkg.pkg.Skype</string>
        <key>Input</key>
        <dict>
            <key>BUNDLE_ID</key>
		        <string>com.skype.skype</string>
            <key>NAME</key>
            <string>Skype</string>
            <key>VERSIONTYPE</key>
            <string>CFBundleVersion</string>
        </dict>
        <key>MinimumVersion</key>
        <string>1.0.0</string>
        <key>ParentRecipe</key>
        <string>com.github.edp-ci.download.Skype</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>input_plist_path</key>
                    <string>%pathname%/Skype.app/Contents/Info.plist</string>
                    <key>plist_version_key</key>
                    <string>%VERSIONTYPE%</string>
                </dict>
                <key>Processor</key>
                <string>Versioner</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>AppPkgCreator</string>
                <key>Arguments</key>
                <dict>
                    <key>pkgname</key>
                    <string>%NAME%-%version%</string>
                </dict>
            </dict>
        </array>
    </dict>
</plist>
